app/Http/Controllers/PagesController.php

    public function home()
    {
        return view('show-products', [
            'categories' => Category::whereIsRoot()->with('image')->get(),
            'title' => 'Latest Products',
            'products' => Product::with('images')->latest()->filter(request(['search']))->paginate(9),
        ]);
---
select * from `images` where `images`.`category_id` in (1, 9)
select * from `images` where `images`.`product_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9)
select * from `products` order by `created_at` desc limit 9 offset 0
select count(*) as aggregate from `products`