app/Http/Controllers/ProductTypesController.php

select * from `product_types`
select * from `products` where `products`.`product_type_id` in (1, 2, 3)
---
    public function index()
    {
        return view('productTypes.productType-manager', [
            'productTypes' => ProductType::all(),
            'title' => 'Product Type Manager',
        ]);