app/Http/Controllers/ProductController.php

select * from `images` where `images`.`product_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50)
select * from `product_types` where `product_types`.`id` in (1)
select `categories`.*, `category_product`.`product_id` as `pivot_product_id`, `category_product`.`category_id` as `pivot_category_id`, `category_product`.`created_at` as `pivot_created_at`, `category_product`.`updated_at` as `pivot_updated_at` from `categories` inner join `category_product` on `categories`.`id` = `category_product`.`category_id` where `category_product`.`product_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50)
---
    public function index()
    {
        return view('product.product-manager', [
            'products' => Product::with([
                'images',
                'categories',
                'productType'
            ])->orderBy('updated_at', 'desc')->get(),
            'title' => 'Product Manager'
        ]);

select * from `products` order by `created_at` desc
---
    public function create()
    {
        return view('product.add-product', [
            'nodes' => Category::get()->toTree(),
            'productTypes' => ProductType::all(),
            'title' => 'Add Product'
        ]);