app/Models/Category.php

select `products`.*, `category_product`.`category_id` as `pivot_category_id`, `category_product`.`product_id` as `pivot_product_id`, `category_product`.`created_at` as `pivot_created_at`, `category_product`.`updated_at` as `pivot_updated_at` from `products` inner join `category_product` on `products`.`id` = `category_product`.`product_id` where `category_product`.`category_id` in (2, 3, 4, 5, 6, 7, 8)
---
    public function getTotalNumberOfNestedProductsAttribute()
    {
        return $this
            ->descendants()
            ->withCount('products')
            ->get()
            ->reduce(function ($carry, $item) {

                return $carry + $item->products_count;

            }, $this->products_count);